# pip install image

import os
from PIL import Image,ImageDraw,ImageFont

def folder_make(text, path):
    # 작업할 경로 지정
    os.chdir(path)

    # 한 글자씩 리스트 저장 
    letter = list(text)
    
    # 이미지 파일 저장할 폴더 만들기 (글자마다 다른 폴더에 저장)
    for i in range(len(letter)):
        os.mkdir(letter[i])

def print_letter(text, path, font_path):
    # 이미지 사이즈 지정
    text_width = 70
    text_height = 70

    # 한 글자씩 리스트 저장 
    letter = list(text)

    # 폰트 경로에서 폰트 이름 추출
    font_list = os.listdir(font_path)
    
    # 이미지 객체 생성 (배경 하양)
    for i in range(len(font_list)):
        for j in range(len(letter)): 
            font = ImageFont.truetype(font_path+str(font_list[i]), 50)
            canvas = Image.new('RGB', (text_width, text_height), "white")
            # 가운데에 그리기 (폰트 색: 검정)
            draw = ImageDraw.Draw(canvas)
            w, h = font.getsize(letter[j])
            draw.text(((text_width-w)/2.0,(text_height-h)/2.0), letter[j], 'black', font)

            # png로 저장 및 출력해서 보기
            # 경로 
            path_folder = path + str(letter[j])
            os.chdir(path_folder)
            canvas.save(letter[j]+str(i)+'.png', "PNG")
            


# 입력 데이터

# 학습할 한자 입력
# text = '佳假價加可家歌街各脚角干看間渴感敢減甘甲强江講降個改皆開客更去居巨擧車乾建堅犬見決潔結京庚慶敬景競經耕輕驚季溪界癸計鷄古告固故考苦高曲穀谷困坤骨公共功工空果科課過官觀關光廣交敎校橋久九口句救求究舊國君軍郡弓勸卷權歸貴均極勤根近今禁金及急給其基己幾技旣期氣記起吉暖難南男乃內女年念怒農能多丹但單短端達談答堂當代大對待德刀到圖島度徒道都獨讀冬動同東洞童斗豆頭得燈登等樂落卵浪郞來冷兩凉良量旅力歷練連列烈令領例禮勞老路露綠論料柳流留六陸倫律利李理里林立馬莫晩滿萬末亡忙忘望妹每買賣麥免勉眠面名命明鳴暮母毛木目卯妙務戊武無舞茂墨問文聞門勿物味尾未米美民密朴半反飯發房放方訪防拜杯白百番伐凡法變別丙兵病保報步伏復服福本奉逢否夫婦富扶浮父部北分不佛朋備比悲非飛鼻貧氷事仕使史四士寺巳射師思死私絲舍謝山散産算殺三上傷商喪尙常想相賞霜色生序暑書西夕席惜昔石仙先善線船選鮮舌設說雪城姓性成星盛省聖聲誠世勢歲洗稅細小少所消笑素俗續速孫松送修受壽守愁手授收數樹水秀誰雖須首叔宿淑純順戌崇拾習乘勝承始市施是時示視詩試式植識食信新申神臣身辛失室實心深甚十氏兒我惡安案眼顔巖暗仰哀愛也夜野弱約若藥揚洋羊讓陽養於漁語魚億憶言嚴業余如汝與餘亦易逆然煙硏悅熱炎葉榮永英迎藝五午吾悟烏誤屋玉溫瓦臥完曰往王外要欲浴勇容用于又友右宇尤憂牛遇雨云運雲雄元原圓園怨遠願月位偉危威爲唯幼有柔油猶由遊遺酉肉育恩銀乙吟陰音飮泣邑應依意矣義衣議醫二以已異移而耳益人仁印因寅引忍認一日壬入姉子字慈者自作昨場壯將章長再哉在才材栽財爭低著貯敵的赤適傳全典前展戰田錢電節絶店接丁井停定庭情政正淨精貞靜頂帝弟祭第製諸除題兆助早朝祖調造鳥族足存尊卒宗從種終鐘坐左罪主住宙晝朱注走酒竹中衆重卽增曾證之只地志持指支枝止知紙至直盡眞辰進質執集且借次此着察參唱昌窓採菜冊責妻處尺千天川泉淺鐵晴淸聽請靑體初招草寸村最推秋追丑祝春出充忠蟲取吹就治致齒則親七針快他打脫探太泰宅土統通退投特波破判八敗貝便片篇平閉布抱暴表品豊風彼皮匹必筆下何夏河賀學寒恨漢閑限韓合恒亥害海解幸行向香虛許革現賢血協兄刑形惠乎呼好戶湖虎號或婚混紅化和火花華話貨患歡活皇黃回會孝效厚後訓休凶胸黑興喜希暇架刻却覺閣刊姦幹懇簡肝監鑑剛康綱鋼介慨槪蓋拒據距件健乞傑儉劍檢擊格激隔牽絹肩遣缺兼謙傾卿境徑硬竟警鏡頃係啓契戒桂械系繫繼階姑孤庫枯稿顧鼓哭供孔恐恭攻貢寡誇郭冠寬慣管貫館狂鑛掛塊壞怪愧巧矯較郊丘俱具區懼拘構狗球苟驅龜局菊群屈宮窮券拳厥軌鬼叫糾規菌克劇僅斤謹琴禽錦級肯企器奇寄忌旗棄機欺畿祈紀豈飢騎緊那諾納娘奈耐寧努奴惱腦泥茶團壇斷旦檀段擔淡踏唐糖黨帶臺貸隊倒塗導挑桃渡盜稻跳逃途陶毒督篤敦豚突凍銅屯鈍騰羅絡亂欄蘭濫覽廊掠略梁糧諒勵慮麗曆憐戀聯蓮鍊劣裂廉獵嶺零靈爐祿錄鹿弄賴雷了僚龍屢樓淚漏累類輪栗隆陵吏履梨裏離臨磨麻幕漠慢漫妄罔茫埋媒梅脈孟猛盟盲綿滅冥銘侮冒募慕某模謀貌牧睦沒夢蒙墓廟苗貿霧默微眉迷憫敏蜜博拍泊薄迫伴叛班盤般返拔髮傍妨芳邦倍培排背輩配伯煩繁罰犯範壁碧辨辯邊屛竝寶普補譜卜腹複覆封峯蜂鳳付副府符簿腐負賦赴附墳奔奮憤粉紛拂崩卑妃婢批碑秘肥費賓頻聘似司寫捨斜斯沙祀社蛇詐詞賜辭邪削朔像償嘗床桑狀祥裳詳象索庶徐恕敍署誓逝析釋宣旋禪攝涉召掃昭燒疏蔬蘇訴騷屬束粟損訟誦頌刷鎖衰囚垂帥搜殊獸睡輸遂隨需孰熟肅巡循旬殉瞬脣術述濕襲僧昇侍矢息飾伸晨審尋雙亞牙芽雅餓岳岸雁謁壓押央殃涯厄額耶躍壤楊樣御抑焉予輿域役疫譯驛宴延沿演燃燕緣軟鉛閱染鹽影映泳營詠譽銳豫傲嗚娛獄擁翁緩畏搖腰謠遙慾辱庸偶優愚羽郵韻員援源院越僞圍委慰緯胃衛謂違乳儒幽悠惟愈維裕誘潤閏隱淫凝儀宜疑夷翼姻逸任賃刺姿恣紫玆資爵酌殘暫潛雜丈墻奬帳張掌粧腸莊葬藏裝障宰災裁載底抵寂摘滴積籍績賊跡專殿轉切折竊占漸點蝶亭廷征整程訂制堤提濟際齊弔操條潮照燥租組拙縱佐座周奏州柱株洲珠舟鑄俊準遵仲憎症蒸贈智池誌遲織職振珍陣陳震姪疾秩徵懲差捉錯讚贊慘倉創暢蒼債彩策戚拓斥薦賤踐遷哲徹尖添妾廳替滯逮遞抄礎秒肖超促燭觸總聰銃催抽醜畜築縮蓄逐衝臭趣醉側測層値恥置漆侵寢枕沈浸稱墮妥卓托濁濯彈歎炭誕奪貪塔湯怠態殆擇澤吐討痛透鬪把播派罷頗板版販偏編遍評幣廢弊肺蔽包捕浦胞飽幅爆標漂票疲被避畢荷鶴旱汗割含咸陷巷抗港航項奚該核享響憲獻軒險驗懸玄絃縣顯穴嫌脅亨螢衡兮慧互毫浩胡護豪惑昏魂忽弘洪鴻禍禾擴確丸換環還況荒悔懷劃獲橫曉侯候毁揮輝携吸戱稀訣筋汽朗紋森阿液曜笛蹟週稚兎砲楓灰'
# 작업 경로, 폰트 경로 입력
# path = 'C:/Users/user/project/test/'
# font_path = "C:/Users/user/Desktop/Downloads/NotoSansCJKkr-hinted/font/"

# 함수 실행
# 폴더 생성
# folder_make(text, path)
# 이미지 생성
# print_letter(text, path, font_path)